<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"c040bcd9a04c3a32df69a10c1b478f944f9cdd2e4c6a60a3b81cd50275c2f1c2","plan_job_ref":"Job Create Terraform plan (DEV) #5 at https://github.com/AudioProthese/openrms-core-infrastructure/actions/runs/14401890357","plan_out_hash":"02ac4ff969d198d1dede97e12a6df4c5ab7a4e7b87c7228fcb9079cf27a65a64","plan_hash":"54df956693b9c4ffa5b9a0929dd4d88b53c2fc735a434af20e37747b232c9766","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __terraform/dev/__
<details>
<summary>Plan: 1 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # module.dns_zone.azurerm_dns_zone.public will be created
+   resource "azurerm_dns_zone" "public" {
+       id                        = (known after apply)
+       max_number_of_record_sets = (known after apply)
+       name                      = "openrms.fchevalier.net"
+       name_servers              = (known after apply)
+       number_of_record_sets     = (known after apply)
+       resource_group_name       = "rg-openrmscore-dev"

+       soa_record (known after apply)
    }

  # module.network.azurerm_virtual_network.vnet will be updated in-place
!~  resource "azurerm_virtual_network" "vnet" {
        id                             = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openrmscore-dev/providers/Microsoft.Network/virtualNetworks/openrmscore-dev-vnet"
        name                           = "openrmscore-dev-vnet"
!~      subnet                         = [
-           {
-               address_prefixes                              = [
-                   "10.10.1.0/24",
                ]
-               default_outbound_access_enabled               = true
-               delegation                                    = [
-                   {
-                       name               = "aca-delegation"
-                       service_delegation = [
-                           {
-                               actions = [
-                                   "Microsoft.Network/virtualNetworks/subnets/join/action",
                                ]
-                               name    = "Microsoft.App/environments"
                            },
                        ]
                    },
                ]
-               id                                            = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openrmscore-dev/providers/Microsoft.Network/virtualNetworks/openrmscore-dev-vnet/subnets/openrmscore-dev-subnet-aca"
-               name                                          = "openrmscore-dev-subnet-aca"
-               private_endpoint_network_policies             = "Disabled"
-               private_link_service_network_policies_enabled = true
-               security_group                                = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openrmscore-dev/providers/Microsoft.Network/networkSecurityGroups/openrmscore-dev-nsg-aca"
-               service_endpoint_policy_ids                   = []
-               service_endpoints                             = []
#                (1 unchanged attribute hidden)
            },
-           {
-               address_prefixes                              = [
-                   "10.10.2.0/24",
                ]
-               default_outbound_access_enabled               = true
-               delegation                                    = []
-               id                                            = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openrmscore-dev/providers/Microsoft.Network/virtualNetworks/openrmscore-dev-vnet/subnets/openrmscore-dev-subnet-db"
-               name                                          = "openrmscore-dev-subnet-db"
-               private_endpoint_network_policies             = "Disabled"
-               private_link_service_network_policies_enabled = true
-               security_group                                = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openrmscore-dev/providers/Microsoft.Network/networkSecurityGroups/openrmscore-dev-nsg-db"
-               service_endpoint_policy_ids                   = []
-               service_endpoints                             = []
#                (1 unchanged attribute hidden)
            },
-           {
-               address_prefixes                              = [
-                   "10.10.3.0/24",
                ]
-               default_outbound_access_enabled               = true
-               delegation                                    = []
-               id                                            = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openrmscore-dev/providers/Microsoft.Network/virtualNetworks/openrmscore-dev-vnet/subnets/openrmscore-dev-subnet-appgw"
-               name                                          = "openrmscore-dev-subnet-appgw"
-               private_endpoint_network_policies             = "Disabled"
-               private_link_service_network_policies_enabled = true
-               security_group                                = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openrmscore-dev/providers/Microsoft.Network/networkSecurityGroups/openrmscore-dev-nsg-appgw"
-               service_endpoint_policy_ids                   = []
-               service_endpoints                             = []
#                (1 unchanged attribute hidden)
            },
+           {
+               address_prefixes                              = [
+                   "10.10.1.0/24",
                ]
+               default_outbound_access_enabled               = true
+               delegation                                    = [
+                   {
+                       name               = "aca-delegation"
+                       service_delegation = [
+                           {
+                               actions = [
+                                   "Microsoft.Network/virtualNetworks/subnets/action",
                                ]
+                               name    = "Microsoft.App/environments"
                            },
                        ]
                    },
                ]
+               id                                            = (known after apply)
+               name                                          = "openrmscore-dev-subnet-aca"
+               private_endpoint_network_policies             = "Disabled"
+               private_link_service_network_policies_enabled = true
+               security_group                                = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openrmscore-dev/providers/Microsoft.Network/networkSecurityGroups/openrmscore-dev-nsg-aca"
+               service_endpoint_policy_ids                   = []
+               service_endpoints                             = []
#                (1 unchanged attribute hidden)
            },
+           {
+               address_prefixes                              = [
+                   "10.10.2.0/24",
                ]
+               default_outbound_access_enabled               = true
+               delegation                                    = []
+               id                                            = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openrmscore-dev/providers/Microsoft.Network/virtualNetworks/openrmscore-dev-vnet/subnets/openrmscore-dev-subnet-db"
+               name                                          = "openrmscore-dev-subnet-db"
+               private_endpoint_network_policies             = "Disabled"
+               private_link_service_network_policies_enabled = true
+               security_group                                = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openrmscore-dev/providers/Microsoft.Network/networkSecurityGroups/openrmscore-dev-nsg-db"
+               service_endpoint_policy_ids                   = []
+               service_endpoints                             = []
            },
+           {
+               address_prefixes                              = [
+                   "10.10.3.0/24",
                ]
+               default_outbound_access_enabled               = true
+               delegation                                    = []
+               id                                            = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openrmscore-dev/providers/Microsoft.Network/virtualNetworks/openrmscore-dev-vnet/subnets/openrmscore-dev-subnet-appgw"
+               name                                          = "openrmscore-dev-subnet-appgw"
+               private_endpoint_network_policies             = "Disabled"
+               private_link_service_network_policies_enabled = true
+               security_group                                = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openrmscore-dev/providers/Microsoft.Network/networkSecurityGroups/openrmscore-dev-nsg-appgw"
+               service_endpoint_policy_ids                   = []
+               service_endpoints                             = []
            },
        ]
        tags                           = {
            "environment" = "dev"
            "project"     = "openrmscore"
        }
#        (9 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create Terraform plan (DEV) #5](https://github.com/AudioProthese/openrms-core-infrastructure/actions/runs/14401890357)